Revit 2027 API
BuiltInFailures.ExtrusionFailures Class
 Failures about Extrusions.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ExtrusionFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ExtrusionFailures
Public NotInheritable Class ExtrusionFailures
public ref class ExtrusionFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExtrusionFailures = class end
The BuiltInFailures.ExtrusionFailures type exposes the following members.
Properties
Name | Description
CannotDrawExtrusions |  Can't make Extrusion.
CannotDrawExtrusionsError |  Can't make Extrusion.
ExtrusionTooThin |  Extrusion is too thin.
InvalidExtrusionCurveloop |  Base sketch for extrusion is invalid.
InvalidExtrusionCurveloopError |  Base sketch for extrusion is invalid.
Top
See Also
Reference
Autodesk.Revit.DB Namespace